# Задача 22: Даны два неупорядоченных набора целых чисел (может быть, с повторениями). Выдать без повторений в порядке
# возрастания все те числа, которые встречаются в обоих наборах. Пользователь вводит 2 числа. n - кол-во элементов
# первого множества. m - кол-во элементов второго множества. Затем пользователь вводит сами элементы множеств.

size1 = int(input('Введите раазмер первого набора: '))
a = []
print(type(a))
print(a)
# for i in set1:
#     # i = int(i)
#     i = int(input('Введите число в набор: '))
#     # set1.append(i)
# print(sеt1)

# size2 = int(input('Введите раазмер первого набора: '))
# sеt2 = []*size2
# print(sеt2)

