# 17. Дан список чисел. Определите, сколько в нем встречается различных чисел.

# Дана последовательность из N целых чисел и число K. Необходимо сдвинуть всю последовательность (сдвиг - циклический)
# на K элементов вправо, K – положительное число.

# Напишите программу для печати всех уникальных значений в словаре.
# my_dict = [{"V": "S001"}, {"V": "S002"}, {"VI": "S001"}, {"VI": "S005"}, {"VII": " S005 "}, {"V":" S009 "},
# {"VIII":" S007 "}]


# Дан список, состоящий из целых чисел. Напишите программу, которая подсчитает количество элементов списка,
# больших предыдущего (элемента с предыдущим номером)