# 1. Последовательностью Фибоначчи называется последовательность чисел a0, a1, ..., an, ..., где
# # a0 = 0, a1 = 1, ak = ak-1 + ak-2 (k > 1).
# # Требуется найти N-е число Фибоначчи
# ______________________
# Хакер Василий получил доступ к классному журналу и хочет заменить все свои минимальные оценки на максимальные.
# Напишите программу, которая заменяет оценки Василия, но наоборот: все максимальные – на минимальные.
# _______________
# 1. Напишите функцию, которая принимает одно число и проверяет, является ли оно простым
#
# *Напоминание: Простое число - это число, которое имеет 2 делителя: 1  и n(само число)*
# ___________
# 1. Дано натуральное число *N* и последовательность из *N* элементов. Требуется вывести эту последовательность в
# обратном порядке.
# ***Примечание.*** В программе запрещается объявлять массивы и использовать циклы (даже для ввода и вывода).