# 1. Сумма трех
# Посчитайте сумму трех введенных целых чисел
#
# 2. Площадь
# Пользователь вводит стороны прямоугольника, выведите его площадь
#
# 3. Периметр
# Пользователь вводит стороны прямоугольника, выведите его периметр

'''a = int(input('Введите первое число '))
b = int(input('Введите второе число '))
c = int(input('Введите третье число '))

sum = a + b + c

print(sum)'''

# a = float(input('Введите первую сторону прямоугольника '))
# b = float(input('Введите вторую сторону прямоугольника '))
#
# s = a * b
# p = (a * b) * 2
#
# print(f'площадь прямоугольниика = {s}, периметр прямоугольника = {p}')

name = 'Alex'
age = 24
print('Вас зовут ' + name + ' ' + str(age))
print('Вас зовут', name, age)
print(f'Вас зовут {name} {age}')
